blog/app/controllers/comments_controller.rb

  def create
    @post.comments.create! comments_params
---
INSERT INTO "comments" ("post_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 1], ["body", "here"], ["created_at", "2017-07-18 19:27:18.572202"], ["updated_at", "2017-07-18 19:27:18.572202"]]